from itertools import groupby


list_version = [
    ['665587', 2], ['669532', 1], ['669537', 2],
    ['669532', 1], ['665587', 1],
    ['123456', 3], ['789012', 2], ['987654', 1],
    ['123456', 2], ['789012', 1],
    ['111222', 3], ['333444', 1], ['555666', 2],
    ['111222', 2], ['333444', 1],
    ['777888', 2], ['999000', 1], ['111999', 3],
    ['777888', 1], ['999000', 2],
    ['444555', 1], ['666777', 2], ['888999', 3],
    ['444555', 2], ['666777', 1],
    ['222333', 3], ['444666', 2], ['888555', 1],
    ['222333', 2], ['444666', 1]
]


# Сортируем список перед применением groupby
list_version.sort(key=lambda x: (x[0], x[1]))

# Группируем значения по id и version
grouped_version = [[key[0], key[1], len(list(group))] for key, group in groupby(list_version, key=lambda x: (x[0], x[1]))]

print(grouped_version)
